GTD.org
# ------------------------------------------------------------------------------
#+TITLE:     Get Things Done with Emacs
#+SUBTITLE:  Nicolas P. Rougier - September 2020
#+AUTHOR:    Nicolas P. Rougier
#+EMAIL:     Nicolas.Rougier@inria.fr
#+LANGUAGE:  en
#+STARTUP:   content showstars indent inlineimages hideblocks
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="GTD.css" />
#+OPTIONS:   toc:2 html-scripts:nil num:nil html-postamble:nil html-style:nil ^:nil
# ------------------------------------------------------------------------------

* Introduction
#+HTML: <div class="back"><a href="#table-of-contents">⌘ Back to top</a></div>

Before I start describing how I organize my professional life using Emacs
and org-mode, let me introduce myself. I'm a [[https://www.labri.fr/perso/nrougier/][researcher in computational
neuroscience]] working at the [[https://www.imn-bordeaux.org/en/][Institute of Neurodegenerative Diseases]] in
Bordeaux (France). As such, my main tasks during a typical day are meetings
with my PhD students (physical or online), team and grant meetings
(physical or online), development (GitHub), reading (online), reviewing
(online) and writing (books, papers, grants, notes, etc). I'm also
co-founder and editor in chief for [[https://rescience.github.io/][ReScience C]] and [[http://rescience.org/x][ReScience X]] and I'm
involved in several academic and open source projects. I receive
approximately 100 mails and 10 GitHub notifications a day.

As of September 2020, I'm supervising five PhD students (two first year,
one second year, one third year and one finishing). I'm currently writing a
book ([[https://github.com/rougier/scientific-visualization-book][Scientific Visualization — Python & Matplotlib]]), handling the
simulatenous writing of 6 academic papers (at various stages), while
preparing a SciFi festival ([[https://hypermondes.fr/][Hypermondes]]), a hackaton ([[https://github.com/reprohack/reprohack-hq][ReproHack @
Bordeaux]]), a workshop ([[https://github.com/ReScience/ten-years][Ten Years Reproducibility Challenge]]) and a summer
school ([[https://aspp.school/wiki/][ASPP 2021]]) to be held in Bordeaux in 2021.

All these activities requires some organisation.

** Get Things Done

I've decided some weeks ago to (try to) adopt the method of David Allen
named "Get Things Done" (GTD). A lot of people were giving very positive
feedback about this method and there are a lot of related resources
online, including several Emacs/org-mode setup. This helped me a lot to
design my own setup since I did not read the book, but I found a nice
[[https://todoist.com/productivity-methods/getting-things-done][summary]]:

1. *Capture* anything that crosses your mind, nothing is too big or small. 
2. *Clarify* what you’ve captured into clear and concrete action steps. 
3. *Organize* and put everything into the right place.
4. *Review*, update, and revise your lists.
5. *Engage* Get to work on the important stuff.

Then I read a lot of other Emacs specific resources that were incredibly
useful but also a bit complex because people introduced their full setup
making it difficult to understand it sometime. Since I'm still in the setup
phase, I've decided to document the process while designing it, hoping it
will be helpful for others.

If you want to read my current full setup, just go the end of this
document. Else, you can read each section and discover the process step by
step. Note that this means we'll write some parts only to be rewritten
later with some improvements, just for the sake of clarity.

** About this document

In all the following section, I'll suppose you're familiar with emacs (of
course) and knows bit of org-mode. If this is not the case, you can follow
the different links I've inserted. They point to the relevant section in
the org-mode manual. We'll start with a Vanilla emacs without any initial
configuration ("/emacs -q -- GTD.el"/) such that you should obtain the same
result as me. =GTD.el= will be given in each section.

The address of this document is: https://www.labri.fr/perso/nrougier/GTD/index.html\\
The sources of this document is: https://github.com/rougier/emacs-GTD

** License

This document has been written in org mode ([[file:GTD.org][=GTD.org=]]) using a customized
CSS stylesheet ([[file:GTD.css][=GTD.css=)]] released (both) under a [[https://creativecommons.org/licenses/by/4.0/][CC-BY 4.0 international
license]]. Feel free to re-use it if you like it.

