GTD.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-05 Tue 21:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Get Things Done with Emacs</title>
<meta name="author" content="Nicolas P. Rougier" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="GTD.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Get Things Done with Emacs
<br />
<span class="subtitle">Nicolas P. Rougier - September 2020</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2d1a786">Introduction</a>
<ul>
<li><a href="#org34af295">Get Things Done</a></li>
<li><a href="#org6a84e44">About this document</a></li>
<li><a href="#org2b1faee">License</a></li>
<li><a href="#org5ed3798">Resources</a></li>
</ul>
</li>
<li><a href="#orgbe6fce8">Inbox</a>
<ul>
<li><a href="#org947d62d">Basic setup</a></li>
<li><a href="#orgae380b3">Working with mail</a></li>
<li><a href="#org9683e20">Capturing tasks</a></li>
<li><a href="#orgfc57a12">Summary</a></li>
</ul>
</li>
<li><a href="#org212bab5">Agenda</a>
<ul>
<li><a href="#org2d62325">Basic setup (I)</a></li>
<li><a href="#org766e892">Recurrent events</a></li>
<li><a href="#org8696764">Meetings &amp; notes</a></li>
<li><a href="#org6db3673">Summary</a></li>
</ul>
</li>
<li><a href="#orgf831e2f">Review</a>
<ul>
<li><a href="#orgd62eb19">Basic setup</a></li>
<li><a href="#org8c6ecc6">Moving things</a></li>
<li><a href="#org3fd9e80">Activating tasks</a></li>
<li><a href="#orgd2d7c02">Summary</a></li>
</ul>
</li>
<li><a href="#org3178978">Doing things</a>
<ul>
<li><a href="#org9f2e38c">Agenda setup (II)</a></li>
<li><a href="#org6bf79fc">Completing a task</a></li>
<li><a href="#org0993877">Summary</a></li>
</ul>
</li>
<li><a href="#orgad6a3d9">Additional changes</a>
<ul>
<li><a href="#orgd8a3d64">Automatic saving after refilling</a></li>
</ul>
</li>
<li><a href="#org326d709">Conclusion</a>
<ul>
<li><a href="#orgbbabfb3">Going further</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2d1a786" class="outline-2">
<h2 id="org2d1a786">Introduction</h2>
<div class="outline-text-2" id="text-org2d1a786">
<div class="back"><a href="#table-of-contents">⌘ Back to top</a></div>

<p>
Before I start describing how I organize my professional life using Emacs
and org-mode, let me introduce myself. I'm a <a href="https://www.labri.fr/perso/nrougier/">researcher in computational
neuroscience</a> working at the <a href="https://www.imn-bordeaux.org/en/">Institute of Neurodegenerative Diseases</a> in
Bordeaux (France). As such, my main tasks during a typical day are meetings
with my PhD students (physical or online), team and grant meetings
(physical or online), development (GitHub), reading (online), reviewing
(online) and writing (books, papers, grants, notes, etc). I'm also
co-founder and editor in chief for <a href="https://rescience.github.io/">ReScience C</a> and <a href="http://rescience.org/x">ReScience X</a> and I'm
involved in several academic and open source projects. I receive
approximately 100 mails and 10 GitHub notifications a day.
</p>

<p>
As of September 2020, I'm supervising five PhD students (two first year,
one second year, one third year and one finishing). I'm currently writing a
book (<a href="https://github.com/rougier/scientific-visualization-book">Scientific Visualization — Python &amp; Matplotlib</a>), handling the
simulatenous writing of 6 academic papers (at various stages), while
preparing a SciFi festival (<a href="https://hypermondes.fr/">Hypermondes</a>), a hackaton (<a href="https://github.com/reprohack/reprohack-hq">ReproHack @
Bordeaux</a>), a workshop (<a href="https://github.com/ReScience/ten-years">Ten Years Reproducibility Challenge</a>) and a summer
school (<a href="https://aspp.school/wiki/">ASPP 2021</a>) to be held in Bordeaux in 2021.
</p>

<p>
All these activities requires some organisation.
</p>
</div>

<div id="outline-container-org34af295" class="outline-3">
<h3 id="org34af295">Get Things Done</h3>
<div class="outline-text-3" id="text-org34af295">
<p>
I've decided some weeks ago to (try to) adopt the method of David Allen
named "Get Things Done" (GTD). A lot of people were giving very positive
feedback about this method and there are a lot of related resources
online, including several Emacs/org-mode setup. This helped me a lot to
design my own setup since I did not read the book, but I found a nice
<a href="https://todoist.com/productivity-methods/getting-things-done">summary</a>:
</p>

<ol class="org-ol">
<li><b>Capture</b> anything that crosses your mind, nothing is too big or small.</li>
<li><b>Clarify</b> what you’ve captured into clear and concrete action steps.</li>
<li><b>Organize</b> and put everything into the right place.</li>
<li><b>Review</b>, update, and revise your lists.</li>
<li><b>Engage</b> Get to work on the important stuff.</li>
</ol>

<p>
Then I read a lot of other Emacs specific resources that were incredibly
useful but also a bit complex because people introduced their full setup
making it difficult to understand it sometime. Since I'm still in the setup
phase, I've decided to document the process while designing it, hoping it
will be helpful for others.
</p>

<p>
If you want to read my current full setup, just go the end of this
document. Else, you can read each section and discover the process step by
step. Note that this means we'll write some parts only to be rewritten
later with some improvements, just for the sake of clarity.
</p>
</div>
</div>

<div id="outline-container-org6a84e44" class="outline-3">
<h3 id="org6a84e44">About this document</h3>
<div class="outline-text-3" id="text-org6a84e44">
<p>
In all the following section, I'll suppose you're familiar with emacs (of
course) and knows bit of org-mode. If this is not the case, you can follow
the different links I've inserted. They point to the relevant section in
the org-mode manual. We'll start with a Vanilla emacs without any initial
configuration ("<i>emacs -q &#x2013; GTD.el"</i>) such that you should obtain the same
result as me. <code>GTD.el</code> will be given in each section.
</p>

<p>
The address of this document is: <a href="https://www.labri.fr/perso/nrougier/GTD/index.html">https://www.labri.fr/perso/nrougier/GTD/index.html</a><br />
The sources of this document is: <a href="https://github.com/rougier/emacs-GTD">https://github.com/rougier/emacs-GTD</a>
</p>
</div>
</div>

<div id="outline-container-org2b1faee" class="outline-3">
<h3 id="org2b1faee">License</h3>
<div class="outline-text-3" id="text-org2b1faee">
<p>
This document has been written in org mode (<a href="GTD.org"><code>GTD.org</code></a>) using a customized
CSS stylesheet (<a href="GTD.css"><code>GTD.css</code>)</a> released (both) under a <a href="https://creativecommons.org/licenses/by/4.0/">CC-BY 4.0 international
license</a>. Feel free to re-use it if you like it.
</p>
</div>
</div>
