GTD.org
** Resources

Here are various resources that helped me to design my workflow:

- [[https://blog.jethro.dev/posts/org_mode_workflow_preview/][Org-mode Workflow: A Preview]] by Jethro Kuan (2020)

  #+BEGIN_QUOTE
  This is going to be a multi-part series on Emacs and org-mode. This is
  also going to be a really long series, so before we begin I want to give
  you an idea of what to expect. What I’m about to present is a workflow
  I’ve tweaked over several years. It is a workflow that has constantly
  evolved to adapt to my varying needs. At the time of writing, I have
  completed 3478 todo items, and written over 29000 lines in my personal
  knowledge base.
  #+END_QUOTE

- [[https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html][Orgmode for GTD]] by Nicolas Petton (2017)

  #+BEGIN_QUOTE
  I’ve been using Orgmode to implement the GTD methodology for the last 4
  years. Rather than explaining the GTD methodology itself or how Orgmode
  works, in this post I’ll detail how I use Orgmode to implement GTD.  If
  you don’t know Orgmode and are curious about it, you should head to its
  website first.
  #+END_QUOTE

- [[http://doc.norang.ca/org-mode.html][Org Mode - Organize Your Life In Plain Text!]] by Bernt Hansen (2015)

  #+BEGIN_QUOTE
  I have been using org-mode as my personal information manager for years
  now. I started small with just the default TODO and DONE keywords. I
  added small changes to my workflow and over time it evolved into what is
  described by this document. I still change my workflow and try new things
  regularly. This document describes mature workflows in my current
  org-mode setup. I tend to document changes to my workflow 30 days after
  implementing them (assuming they are still around at that point) so that
  the new workflow has a chance to mature. 
  #+END_QUOTE

- [[http://members.optusnet.com.au/~charles57/GTD/gtd_workflow.html][How I use Emacs and Org-mode to implement GTD ]]by Charles Cave (2009)

  #+BEGIN_QUOTE
  "Getting Things Done" is a book by David Allen in which he describes a
  work-life management system developed after twenty years of consulting
  work. The promise of GTD is "Stress-free productivity" and developing a
  calm state of mind in a state of readiness. Allen's second book, "Ready
  for Anything" elaborates on these principles in a series of essays.  The
  effectiveness of GTD lies in taking a complete and current inventory of
  all your commitments, then organizing and reviewing this information
  regularly in a systematic way. Your work and life can then be viewed from
  different levels of detail allowing you to make choices about what to do
  (and not do) at any moment.
  #+END_QUOTE

And of course, the [[https://orgmode.org/guide/][org-mode documentation]] helped me alot.
  #+BEGIN_QUOTE
  Org is a mode for keeping notes, maintaining TODO lists, and doing
  project planning with a fast and effective plain-text system. It is also
  an authoring and publishing system, and it supports working with source
  code for literal programming and reproducible research.
  #+END_QUOTE

* Inbox
#+HTML: <div class="back"><a href="#table-of-contents">⌘ Back to top</a></div>

** Basic setup

The first step I was interested in was a way to quickly capture any idea
that I may have during the day. My goal was to have a non-disruptive
process, that is, type a key sequence to enter [[https://orgmode.org/guide/Capture.html#Capture][capture mode]], type some text
and then just forget about it. More specifically, I did not want to have to
think where I would store this text nor thinking about any related
information such as tags or date. I chose to store theses ideas in a
=~/Documents/org/inbox.org= file:

#+begin_src lisp
(setq org-directory "~/Documents/org")
(setq org-agenda-files (list "inbox.org"))
#+end_src

My initial =inbox.org= reads (we'll modify it later):

#+begin_src org
 #+STARTUP: content showstars indent
 #+FILETAGS: inbox
#+end_src

The STARTUP line defines some [[https://orgmode.org/manual/In_002dbuffer-Settings.html][buffer settings]] ([[https://orgmode.org/manual/Initial-visibility.html][initial visibility]], [[https://orgmode.org/manual/Org-Indent-Mode.html][indent
mode]] and [[https://orgmode.org/manual/Hard-indentation.html#Hard-indentation][star visibility]]) while the [[https://orgmode.org/manual/Tag-Inheritance.html][FILETAGS]] line defines a common tag that
will be inherited by all entries (=inbox= in this case).

then we can setup a specific capture template for inbox:

#+begin_src lisp
(setq org-capture-templates
       `(("i" "Inbox" entry  (file "inbox.org")
        ,(concat "* TODO %?\n"
                 "/Entered on/ %U"))))
#+end_src

and setup a keyboard shortcut (=C-c c=):

#+begin_src lisp
(define-key global-map (kbd "C-c c") 'org-capture)
#+end_src

Note that this binding will invoke the org capture menu and to add
something to the inbox, the full sequence is =C-c c i=. Since I intend
to use it quite often, I prefer to have shorter bindings:

#+begin_src lisp
(defun org-capture-inbox ()
     (interactive)
     (call-interactively 'org-store-link)
     (org-capture nil "i"))

(define-key global-map (kbd "C-c i") 'org-capture-inbox)
#+end_src

