GTD.html

<div id="outline-container-org5ed3798" class="outline-3">
<h3 id="org5ed3798">Resources</h3>
<div class="outline-text-3" id="text-org5ed3798">
<p>
Here are various resources that helped me to design my workflow:
</p>

<ul class="org-ul">
<li><p>
<a href="https://blog.jethro.dev/posts/org_mode_workflow_preview/">Org-mode Workflow: A Preview</a> by Jethro Kuan (2020)
</p>

<blockquote>
<p>
This is going to be a multi-part series on Emacs and org-mode. This is
also going to be a really long series, so before we begin I want to give
you an idea of what to expect. What I’m about to present is a workflow
I’ve tweaked over several years. It is a workflow that has constantly
evolved to adapt to my varying needs. At the time of writing, I have
completed 3478 todo items, and written over 29000 lines in my personal
knowledge base.
</p>
</blockquote></li>

<li><p>
<a href="https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html">Orgmode for GTD</a> by Nicolas Petton (2017)
</p>

<blockquote>
<p>
I’ve been using Orgmode to implement the GTD methodology for the last 4
years. Rather than explaining the GTD methodology itself or how Orgmode
works, in this post I’ll detail how I use Orgmode to implement GTD.  If
you don’t know Orgmode and are curious about it, you should head to its
website first.
</p>
</blockquote></li>

<li><p>
<a href="http://doc.norang.ca/org-mode.html">Org Mode - Organize Your Life In Plain Text!</a> by Bernt Hansen (2015)
</p>

<blockquote>
<p>
I have been using org-mode as my personal information manager for years
now. I started small with just the default TODO and DONE keywords. I
added small changes to my workflow and over time it evolved into what is
described by this document. I still change my workflow and try new things
regularly. This document describes mature workflows in my current
org-mode setup. I tend to document changes to my workflow 30 days after
implementing them (assuming they are still around at that point) so that
the new workflow has a chance to mature. 
</p>
</blockquote></li>

<li><p>
<a href="http://members.optusnet.com.au/~charles57/GTD/gtd_workflow.html">How I use Emacs and Org-mode to implement GTD </a>by Charles Cave (2009)
</p>

<blockquote>
<p>
"Getting Things Done" is a book by David Allen in which he describes a
work-life management system developed after twenty years of consulting
work. The promise of GTD is "Stress-free productivity" and developing a
calm state of mind in a state of readiness. Allen's second book, "Ready
for Anything" elaborates on these principles in a series of essays.  The
effectiveness of GTD lies in taking a complete and current inventory of
all your commitments, then organizing and reviewing this information
regularly in a systematic way. Your work and life can then be viewed from
different levels of detail allowing you to make choices about what to do
(and not do) at any moment.
</p>
</blockquote></li>
</ul>

<p>
And of course, the <a href="https://orgmode.org/guide/">org-mode documentation</a> helped me alot.
</p>
<blockquote>
<p>
Org is a mode for keeping notes, maintaining TODO lists, and doing
project planning with a fast and effective plain-text system. It is also
an authoring and publishing system, and it supports working with source
code for literal programming and reproducible research.
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orgbe6fce8" class="outline-2">
<h2 id="orgbe6fce8">Inbox</h2>
<div class="outline-text-2" id="text-orgbe6fce8">
<div class="back"><a href="#table-of-contents">⌘ Back to top</a></div>
</div>

<div id="outline-container-org947d62d" class="outline-3">
<h3 id="org947d62d">Basic setup</h3>
<div class="outline-text-3" id="text-org947d62d">
<p>
The first step I was interested in was a way to quickly capture any idea
that I may have during the day. My goal was to have a non-disruptive
process, that is, type a key sequence to enter <a href="https://orgmode.org/guide/Capture.html#Capture">capture mode</a>, type some text
and then just forget about it. More specifically, I did not want to have to
think where I would store this text nor thinking about any related
information such as tags or date. I chose to store theses ideas in a
<code>~/Documents/org/inbox.org</code> file:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq org-directory <span class="org-string">"~/Documents/org"</span>)
(setq org-agenda-files (list <span class="org-string">"inbox.org"</span>))
</pre>
</div>

<p>
My initial <code>inbox.org</code> reads (we'll modify it later):
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+STARTUP: content showstars indent</span>
<span class="org-org-meta-line">#+FILETAGS: inbox</span>
</pre>
</div>

<p>
The STARTUP line defines some <a href="https://orgmode.org/manual/In_002dbuffer-Settings.html">buffer settings</a> (<a href="https://orgmode.org/manual/Initial-visibility.html">initial visibility</a>, <a href="https://orgmode.org/manual/Org-Indent-Mode.html">indent
mode</a> and <a href="https://orgmode.org/manual/Hard-indentation.html#Hard-indentation">star visibility</a>) while the <a href="https://orgmode.org/manual/Tag-Inheritance.html">FILETAGS</a> line defines a common tag that
will be inherited by all entries (<code>inbox</code> in this case).
</p>

<p>
then we can setup a specific capture template for inbox:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq org-capture-templates
       `((<span class="org-string">"i"</span> <span class="org-string">"Inbox"</span> entry  (file <span class="org-string">"inbox.org"</span>)
        ,(concat <span class="org-string">"* TODO %?\n"</span>
                 <span class="org-string">"/Entered on/ %U"</span>))))
</pre>
</div>

<p>
and setup a keyboard shortcut (<code>C-c c</code>):
</p>

<div class="org-src-container">
<pre class="src src-lisp">(define-key global-map (kbd <span class="org-string">"C-c c"</span>) 'org-capture)
</pre>
</div>

<p>
Note that this binding will invoke the org capture menu and to add
something to the inbox, the full sequence is <code>C-c c i</code>. Since I intend
to use it quite often, I prefer to have shorter bindings:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">org-capture-inbox</span> ()
     (interactive)
     (call-interactively 'org-store-link)
     (org-capture nil <span class="org-string">"i"</span>))

(define-key global-map (kbd <span class="org-string">"C-c i"</span>) 'org-capture-inbox)
</pre>
</div>
</div>
</div>
