GTD.org
** Working with mail

For a long time, I've been using my mail inbox as a todo box, i.e. a
collection of emails that call for action. Any mail that was not archived
requested an answer in the short or long term. I doubt this is the
recommended way of handling the inbox (but is there any?) but since I
decided to move to GTD, it was also the opportunity to handle my mail
differently. A few months back, I moved away from the default system email
client on my OSX machine and started to use the almighty [[https://www.djcbsoftware.nl/code/mu/mu4e/][mu4e]] (mu for
emacs) that provides a very smooth [[https://www.djcbsoftware.nl/code/mu/mu4e/Org_002dmode-links.html][capture integration]]. We can thus add a
new template for quickly capturing a "Reply to" action to be filed in the
inbox.

#+begin_src lisp
(setq org-capture-templates
      `(("i" "Inbox" entry  (file "inbox.org")
        ,(concat "* TODO %?\n"
                 "/Entered on/ %U"))
        ("@" "Inbox [mu4e]" entry (file "inbox.org")
        ,(concat "* TODO Process \"%a\" %?\n"
                 "/Entered on/ %U"))))
#+end_src

We can now define a binding for headers and view mode:

#+begin_src lisp
(define-key mu4e-headers-mode-map (kbd "C-c c") 'mu4e-org-store-and-capture)
(define-key mu4e-view-mode-map    (kbd "C-c c") 'mu4e-org-store-and-capture)
#+end_src

To register a reply action, the full sequence is thus =C-c c @=.
Since I'm lazy, let's shorten it to =C-c i=:

#+begin_src lisp
(defun org-capture-mail ()
  (interactive)
  (call-interactively 'org-store-link)
  (org-capture nil "@"))

(define-key mu4e-headers-mode-map (kbd "C-c i") 'org-capture-mail)
(define-key mu4e-view-mode-map    (kbd "C-c i") 'org-capture-mail)
#+end_src

Last thing is a small [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Hooks.html][hook]] to tell org-capture to use the full window
instead of splitting the current window. This is not mandatory at all and
mostly depends on your taste.

#+begin_src lisp
(add-hook 'org-capture-mode-hook 'delete-other-windows)
#+end_src

** Capturing tasks

Any time you want to enter something in your inbox, be it a note or
something related to a mail, just type =C-c i= and you should see the
following capture window:

#+begin_src org
*Capture buffer. Finish 'C-c C-c', refile 'C-c C-w', abort 'C-c C-k'.*
,* TODO +_+
  /Entered on [2020-09-11 Fri 07:53]/
#+end_src

For mail related note, you don't have to do anything:

#+begin_src org
*Capture buffer. Finish 'C-c C-c', refile 'C-c C-w', abort 'C-c C-k'.*
,* TODO Process "Adaptive Computation Time …" +_+
  /Entered on [2020-09-08 Tue 08:51]/
#+end_src

My inbox notes are generally short (verb + subject) because I use a daily
review and it is generally enough information for later processing. To give
you an idea, here is my current inbox (/2020-09-11 Fri/). Note that all the
=Process= entries links to the relevant mail.

#+begin_src org
,#+STARTUP: content showstars indent
,#+FILETAGS: inbox
,* TODO Organize bibliography …
,* TODO Process "Adaptive Computation Time …" …
,* TODO Process "Relevant paper" …
,* TODO Mail F.Wagner about team talk …
,* TODO Buy "Canon printer" …
,* TODO Process "ICDL oral presentation" …
,* TODO Write discussion (plasticity paper) …
,* TODO Compute VSOM δxδy representation …
#+end_src

During the review, some of these notes will be filed directly under an
existing project, some will be split in several subtasks and some others
will lead to the creation of a new project.

** Summary 

Our first (incomplete) GTD configuration is:

#+HTML: <details><summary><b>GTD.el</b> (version 1)</summary>
#+begin_src lisp
(require 'org)

(setq org-directory "~/Documents/org")
(setq org-agenda-files (list "inbox.org"))

(setq org-capture-templates
      `(("i" "Inbox" entry  (file "inbox.org")
        ,(concat "* TODO %?\n"
                 "/Entered on/ %U"))
        ("@" "Inbox [mu4e]" entry (file "inbox.org")
        ,(concat "* TODO Reply to \"%a\" %?\n"
                 "/Entered on/ %U"))))

(defun org-capture-inbox ()
     (interactive)
     (call-interactively 'org-store-link)
     (org-capture nil "i"))

(defun org-capture-mail ()
  (interactive)
  (call-interactively 'org-store-link)
  (org-capture nil "@"))

;; Use full window for org-capture
(add-hook 'org-capture-mode-hook 'delete-other-windows)

(define-key global-map            (kbd "C-c c") 'org-capture)
(define-key global-map            (kbd "C-c i") 'org-capture-inbox)

;; Only if you use mu4e
;; (require 'mu4e)
;; (define-key mu4e-headers-mode-map (kbd "C-c i") 'org-capture-mail)
;; (define-key mu4e-view-mode-map    (kbd "C-c i") 'org-capture-mail)
#+end_src
#+HTML: </details>

The set of available commands at this point is:

| Command                      | Bindings         | Mode + where           |
|------------------------------+------------------|------------------------|
| Capture menu                 | *C-c c*            | any                    |
| Capture a new TODO           | *C-c i* or *C-c c i* | any                    |
| Capture a mail-related TODO  | *C-c i* or *C-c c @* | mu4e view/headers mode |

* Agenda
#+HTML: <div class="back"><a href="#table-of-contents">⌘ Back to top</a></div>

