GTD.html

<div id="outline-container-orgae380b3" class="outline-3">
<h3 id="orgae380b3">Working with mail</h3>
<div class="outline-text-3" id="text-orgae380b3">
<p>
For a long time, I've been using my mail inbox as a todo box, i.e. a
collection of emails that call for action. Any mail that was not archived
requested an answer in the short or long term. I doubt this is the
recommended way of handling the inbox (but is there any?) but since I
decided to move to GTD, it was also the opportunity to handle my mail
differently. A few months back, I moved away from the default system email
client on my OSX machine and started to use the almighty <a href="https://www.djcbsoftware.nl/code/mu/mu4e/">mu4e</a> (mu for
emacs) that provides a very smooth <a href="https://www.djcbsoftware.nl/code/mu/mu4e/Org_002dmode-links.html">capture integration</a>. We can thus add a
new template for quickly capturing a "Reply to" action to be filed in the
inbox.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq org-capture-templates
      `((<span class="org-string">"i"</span> <span class="org-string">"Inbox"</span> entry  (file <span class="org-string">"inbox.org"</span>)
        ,(concat <span class="org-string">"* TODO %?\n"</span>
                 <span class="org-string">"/Entered on/ %U"</span>))
        (<span class="org-string">"@"</span> <span class="org-string">"Inbox [mu4e]"</span> entry (file <span class="org-string">"inbox.org"</span>)
        ,(concat <span class="org-string">"* TODO Process \"%a\" %?\n"</span>
                 <span class="org-string">"/Entered on/ %U"</span>))))
</pre>
</div>

<p>
We can now define a binding for headers and view mode:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(define-key mu4e-headers-mode-map (kbd <span class="org-string">"C-c c"</span>) 'mu4e-org-store-and-capture)
(define-key mu4e-view-mode-map    (kbd <span class="org-string">"C-c c"</span>) 'mu4e-org-store-and-capture)
</pre>
</div>

<p>
To register a reply action, the full sequence is thus <code>C-c c @</code>.
Since I'm lazy, let's shorten it to <code>C-c i</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">org-capture-mail</span> ()
  (interactive)
  (call-interactively 'org-store-link)
  (org-capture nil <span class="org-string">"@"</span>))

(define-key mu4e-headers-mode-map (kbd <span class="org-string">"C-c i"</span>) 'org-capture-mail)
(define-key mu4e-view-mode-map    (kbd <span class="org-string">"C-c i"</span>) 'org-capture-mail)
</pre>
</div>

<p>
Last thing is a small <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Hooks.html">hook</a> to tell org-capture to use the full window
instead of splitting the current window. This is not mandatory at all and
mostly depends on your taste.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(add-hook 'org-capture-mode-hook 'delete-other-windows)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9683e20" class="outline-3">
<h3 id="org9683e20">Capturing tasks</h3>
<div class="outline-text-3" id="text-org9683e20">
<p>
Any time you want to enter something in your inbox, be it a note or
something related to a mail, just type <code>C-c i</code> and you should see the
following capture window:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-bold">Capture buffer. Finish 'C-c C-c', refile 'C-c C-w', abort 'C-c C-k'.</span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> </span><span class="org-org-level-1"><span class="custom">_</span></span>
  <span class="org-italic">Entered on </span><span class="org-org-date"><span class="org-italic">[2020-09-11 Fri 07:53]</span></span>
</pre>
</div>

<p>
For mail related note, you don't have to do anything:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-bold">Capture buffer. Finish 'C-c C-c', refile 'C-c C-w', abort 'C-c C-k'.</span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Process "Adaptive Computation Time &#8230;" </span><span class="org-org-level-1"><span class="custom">_</span></span>
  <span class="org-italic">Entered on </span><span class="org-org-date"><span class="org-italic">[2020-09-08 Tue 08:51]</span></span>
</pre>
</div>

<p>
My inbox notes are generally short (verb + subject) because I use a daily
review and it is generally enough information for later processing. To give
you an idea, here is my current inbox (<i>2020-09-11 Fri</i>). Note that all the
<code>Process</code> entries links to the relevant mail.
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+STARTUP: content showstars indent</span>
<span class="org-org-meta-line">#+FILETAGS: inbox</span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Organize bibliography &#8230;</span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Process "Adaptive Computation Time &#8230;" &#8230;</span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Process "Relevant paper" &#8230;</span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Mail F.Wagner about team talk &#8230;</span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Buy "Canon printer" &#8230;</span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Process "ICDL oral presentation" &#8230;</span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Write discussion (plasticity paper) &#8230;</span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Compute VSOM &#948;x&#948;y representation &#8230;</span>
</pre>
</div>

<p>
During the review, some of these notes will be filed directly under an
existing project, some will be split in several subtasks and some others
will lead to the creation of a new project.
</p>
</div>
</div>

<div id="outline-container-orgfc57a12" class="outline-3">
<h3 id="orgfc57a12">Summary</h3>
<div class="outline-text-3" id="text-orgfc57a12">
<p>
Our first (incomplete) GTD configuration is:
</p>

<details><summary><b>GTD.el</b> (version 1)</summary>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">org</span>)

(setq org-directory <span class="org-string">"~/Documents/org"</span>)
(setq org-agenda-files (list <span class="org-string">"inbox.org"</span>))

(setq org-capture-templates
      `((<span class="org-string">"i"</span> <span class="org-string">"Inbox"</span> entry  (file <span class="org-string">"inbox.org"</span>)
        ,(concat <span class="org-string">"* TODO %?\n"</span>
                 <span class="org-string">"/Entered on/ %U"</span>))
        (<span class="org-string">"@"</span> <span class="org-string">"Inbox [mu4e]"</span> entry (file <span class="org-string">"inbox.org"</span>)
        ,(concat <span class="org-string">"* TODO Reply to \"%a\" %?\n"</span>
                 <span class="org-string">"/Entered on/ %U"</span>))))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-capture-inbox</span> ()
     (interactive)
     (call-interactively 'org-store-link)
     (org-capture nil <span class="org-string">"i"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-capture-mail</span> ()
  (interactive)
  (call-interactively 'org-store-link)
  (org-capture nil <span class="org-string">"@"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Use full window for org-capture</span>
(add-hook 'org-capture-mode-hook 'delete-other-windows)

(define-key global-map            (kbd <span class="org-string">"C-c c"</span>) 'org-capture)
(define-key global-map            (kbd <span class="org-string">"C-c i"</span>) 'org-capture-inbox)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Only if you use mu4e</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(require 'mu4e)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(define-key mu4e-headers-mode-map (kbd "C-c i") 'org-capture-mail)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(define-key mu4e-view-mode-map    (kbd "C-c i") 'org-capture-mail)</span>
</pre>
</div>
</details>

<p>
The set of available commands at this point is:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Bindings</th>
<th scope="col" class="org-left">Mode + where</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Capture menu</td>
<td class="org-left"><b>C-c c</b></td>
<td class="org-left">any</td>
</tr>

<tr>
<td class="org-left">Capture a new TODO</td>
<td class="org-left"><b>C-c i</b> or <b>C-c c i</b></td>
<td class="org-left">any</td>
</tr>

<tr>
<td class="org-left">Capture a mail-related TODO</td>
<td class="org-left"><b>C-c i</b> or <b>C-c c @</b></td>
<td class="org-left">mu4e view/headers mode</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
