GTD.org
** Basic setup (I)

Before heading to the review process, we need first to setup the [[https://orgmode.org/manual/Agenda-Views.html#Agenda-Views][agenda]]
that will help us to track daily meetings and tasks. Using the previous
inbox configuration, you can actually already have a view of your inbox
using the =M-x org-agenda= command that will bring up a menu where you can
choose what to display. Before using it, let me first define a new global
key binding (=C-c a=) for quick access to the agenda:

#+begin_src lisp
(define-key global-map (kbd "C-c a") 'org-agenda)
#+end_src

Now, let's see what our tasks look like by invoking the "List of All TODO
entries" using the =t= menu (full sequence is thus =C-c a t=):

#+begin_src org
*Global list of TODO items of type: ALL*
*Press ‘N r’ (e.g. ‘0 r’) to search again: (0)[ALL] (1)TODO (2)DONE*
  inbox:      TODO Organize bibliography                                     /:inbox:/
  inbox:      TODO Process "Adaptive Computation Time…"                      /:inbox:/
  inbox:      TODO Process "Relevant paper"                                  /:inbox:/
  inbox:      TODO Mail F.Wagner about team talk                             /:inbox:/
  inbox:      TODO Buy "Canon printer"                                       /:inbox:/
  inbox:      TODO Process "ICDL oral presentation"                          /:inbox:/
  inbox:      TODO Write discution (plasticity paper)                        /:inbox:/
  inbox:      TODO Compute VSOM δxδy representation                          /:inbox:/
#+end_src

The display of the task list is bit redundant because we have an "inbox" on
the left and an "inbox" on the right. However, they do not have the same
origin. The one on the left is the name of the file where the related TODO
is stored while the one on the right is a tag. If you remember our inbox
file setup header, there was a =#+FILETAGS: inbox= line that assign the
"inbox" tag to each entry. Since tags are redundant, let's just remove them
by filtering them out:

#+begin_src lisp
(setq org-agenda-hide-tags-regexp ".")
#+end_src

With this line, we actually ask the agenda to hide any tag (=.=) that may be
present. Of course, you can choose to be more specific and hide only some
tags, it's up to you. Now we still have to choose what to do with the left
part displaying "inbox". This is displayed because there is no [[https://orgmode.org/manual/Categories.html][category]]
assigned to the entry and when the agenda display a TODO item, the default
behavior is to display the category or the filename if there is no
category. You can of course change what is actually displayed by modifying
the [[https://orgmode.org/manual/Presentation-and-Sorting.html][org-agenda-prefix-format]]:

#+begin_src lisp
(setq org-agenda-prefix-format
      '((agenda . " %i %-12:c%?-12t% s")
        (todo   . " %i %-12:c")
        (tags   . " %i %-12:c")
        (search . " %i %-12:c")))
#+end_src

We could also add a /#+CATEGORY: INBOX/ to the header of our inbox file but I
prefer not to have anything displayed for now. So let's get's rid of the
category display for todo items:

#+begin_src lisp
(setq org-agenda-prefix-format
      '((agenda . " %i %-12:c%?-12t% s")
        (todo   . " ")
        (tags   . " %i %-12:c")
        (search . " %i %-12:c")))
#+end_src

And the result is:

#+begin_src org
*Global list of TODO items of type: ALL*
*Press ‘N r’ (e.g. ‘0 r’) to search again: (0)[ALL] (1)TODO (2)DONE*
  TODO Organize bibliography
  TODO Process "Adaptive Computation Time…"
  TODO Process "Relevant paper"
  TODO Mail F.Wagner about team talk
  TODO Buy "Canon printer"
  TODO Process "ICDL oral presentation"
  TODO Write discution (plasticity paper)
  TODO Compute VSOM δxδy representation
#+end_src

