GTD.html

<div id="outline-container-org212bab5" class="outline-2">
<h2 id="org212bab5">Agenda</h2>
<div class="outline-text-2" id="text-org212bab5">
<div class="back"><a href="#table-of-contents">⌘ Back to top</a></div>
</div>

<div id="outline-container-org2d62325" class="outline-3">
<h3 id="org2d62325">Basic setup (I)</h3>
<div class="outline-text-3" id="text-org2d62325">
<p>
Before heading to the review process, we need first to setup the <a href="https://orgmode.org/manual/Agenda-Views.html#Agenda-Views">agenda</a>
that will help us to track daily meetings and tasks. Using the previous
inbox configuration, you can actually already have a view of your inbox
using the <code>M-x org-agenda</code> command that will bring up a menu where you can
choose what to display. Before using it, let me first define a new global
key binding (<code>C-c a</code>) for quick access to the agenda:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(define-key global-map (kbd <span class="org-string">"C-c a"</span>) 'org-agenda)
</pre>
</div>

<p>
Now, let's see what our tasks look like by invoking the "List of All TODO
entries" using the <code>t</code> menu (full sequence is thus <code>C-c a t</code>):
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-bold">Global list of TODO items of type: ALL</span>
<span class="org-bold">Press &#8216;N r&#8217; (e.g. &#8216;0 r&#8217;) to search again: (0)[ALL] (1)TODO (2)DONE</span>
  inbox:      TODO Organize bibliography                                     <span class="org-italic">:inbox:</span>
  inbox:      TODO Process "Adaptive Computation Time&#8230;"                      <span class="org-italic">:inbox:</span>
  inbox:      TODO Process "Relevant paper"                                  <span class="org-italic">:inbox:</span>
  inbox:      TODO Mail F.Wagner about team talk                             <span class="org-italic">:inbox:</span>
  inbox:      TODO Buy "Canon printer"                                       <span class="org-italic">:inbox:</span>
  inbox:      TODO Process "ICDL oral presentation"                          <span class="org-italic">:inbox:</span>
  inbox:      TODO Write discution (plasticity paper)                        <span class="org-italic">:inbox:</span>
  inbox:      TODO Compute VSOM &#948;x&#948;y representation                          <span class="org-italic">:inbox:</span>
</pre>
</div>

<p>
The display of the task list is bit redundant because we have an "inbox" on
the left and an "inbox" on the right. However, they do not have the same
origin. The one on the left is the name of the file where the related TODO
is stored while the one on the right is a tag. If you remember our inbox
file setup header, there was a <code>#+FILETAGS: inbox</code> line that assign the
"inbox" tag to each entry. Since tags are redundant, let's just remove them
by filtering them out:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq org-agenda-hide-tags-regexp <span class="org-string">"."</span>)
</pre>
</div>

<p>
With this line, we actually ask the agenda to hide any tag (<code>.</code>) that may be
present. Of course, you can choose to be more specific and hide only some
tags, it's up to you. Now we still have to choose what to do with the left
part displaying "inbox". This is displayed because there is no <a href="https://orgmode.org/manual/Categories.html">category</a>
assigned to the entry and when the agenda display a TODO item, the default
behavior is to display the category or the filename if there is no
category. You can of course change what is actually displayed by modifying
the <a href="https://orgmode.org/manual/Presentation-and-Sorting.html">org-agenda-prefix-format</a>:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq org-agenda-prefix-format
      '((agenda . <span class="org-string">" %i %-12:c%?-12t% s"</span>)
        (todo   . <span class="org-string">" %i %-12:c"</span>)
        (tags   . <span class="org-string">" %i %-12:c"</span>)
        (search . <span class="org-string">" %i %-12:c"</span>)))
</pre>
</div>

<p>
We could also add a <i>#+CATEGORY: INBOX</i> to the header of our inbox file but I
prefer not to have anything displayed for now. So let's get's rid of the
category display for todo items:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq org-agenda-prefix-format
      '((agenda . <span class="org-string">" %i %-12:c%?-12t% s"</span>)
        (todo   . <span class="org-string">" "</span>)
        (tags   . <span class="org-string">" %i %-12:c"</span>)
        (search . <span class="org-string">" %i %-12:c"</span>)))
</pre>
</div>

<p>
And the result is:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-bold">Global list of TODO items of type: ALL</span>
<span class="org-bold">Press &#8216;N r&#8217; (e.g. &#8216;0 r&#8217;) to search again: (0)[ALL] (1)TODO (2)DONE</span>
  TODO Organize bibliography
  TODO Process "Adaptive Computation Time&#8230;"
  TODO Process "Relevant paper"
  TODO Mail F.Wagner about team talk
  TODO Buy "Canon printer"
  TODO Process "ICDL oral presentation"
  TODO Write discution (plasticity paper)
  TODO Compute VSOM &#948;x&#948;y representation
</pre>
</div>
</div>
</div>
