GTD.org
** Recurrent events

Beside notes taking, I send or received a number of appointments (generally
through mail) and I need to save them. I prefer not to file them in my
inbox since generally I know both the topic and when they will occur such
that I can directly store them in a dedicated =agenda.org= file that will be
used to store all my scheduled events and meetings. Let's first add this
new file to the list of org files:

#+begin_src lisp
(setq org-agenda-files (list "inbox.org" "agenda.org"))
#+end_src

The initial file has a basic startup header configuration and I also
defined a set of default [[https://orgmode.org/manual/Tags.html][tags]] using the =#+TAGS= syntax. This will ease the
assignment of tags when adding a new entry or modifying an entry (we'll
that later):

#+begin_src org
#+STARTUP: hideall showstars indent
#+TAGS:    event(e) meeting(m) deadline(d)
#+TAGS:    @outside(o) @imn(i) @inria(r) @online(l) @canceled(c)
#+end_src

The structure of my agenda is split into birthdays and recurrent / past /
future events. This quite arbitrary and you can use any a different
structure. 

#+begin_src org
,* *Birthdays*
,* *Recurrent*
  ,* *Scheduled*
  ,* *People*
  ,* *Team*
,* *Past*
,* *Future*
#+end_src

Let's first start filling the birthdays part. For any yearly event such as
birthdays, we can add special entries using the [[https://www.gnu.org/software/emacs/manual/html_node/org/Weekly_002fdaily-agenda.html][org-anniversary]] syntax
(from the [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Diary.html][diary]]).

#+begin_src org
,* *Birthdays*
  %%(org-anniversary 1976 6  1) Emacs is %d years old
  %%(org-anniversary 1953 3 16) Richard Stallman is %d years old
#+end_src

Each time month/day is displayed in the agenda, the corresponding text will
be displayed as well.

For the recurrent events, I make a separation between scheduled, people and
team. In my case, scheduled events are mostly daily events and I use the
agenda as a reminder. I could have used the [[https://orgmode.org/manual/Repeated-tasks.html][repeating tasks]] feature (using
syntax such as /[2020-09-12 Sat 09:00 +1d]/, but the problem is that I wanted
to have some daily repeating task only for workdays and the previous syntax
does not offer such choice. Instead, I've used the [[https://stackoverflow.com/questions/28369833][following code]]:

#+begin_src org
,* *Recurrent*
  ,* *Scheduled*
    ,* *GTD Review* 18:00-18:20                                          /:review:@home:/
      /SCHEDULED: <%%(memq (calendar-day-of-week date) '(1 2 3 4 5))>/
    ,* *Notes cleaning* 18:20-18:30                                      /:review:@home:/
      /SCHEDULED: <%%(memq (calendar-day-of-week date) '(1 2 3 4 5))>/
    ,* *Agenda cleaning*                                                 /:review:@home:/
      /SCHEDULED: <2020-09-01 Tue +1m>/
#+end_src

For recurrent events with people, I do not use the repeating task feature
because I want to be able to cancel a specific meeting if it did not happen
and also to use the entry for taking notes (we will see that below).

#+begin_src org
,* *Recurrent*
  ,* *People*
    ,* *Student A (weekly meeting)*                                           /:meeting:/
      ,* *Student A*                                                        /:@canceled:/
        /<2020-09-14 Mon 10:00-11:00>/
      ,* *Student A*                                                          /:@online:/
        /<2020-09-07 Mon 10:00-11:00>/
      ,* *Student A*                                                             /:@imn:/
        /<2020-09-14 Mon 10:00-11:00>/
#+end_src

For these recurrent events, I write them directly into the agenda file at
the end of a meeting where we generally agree on next meeting. Here is
[[https://emacs.stackexchange.com/questions/10504][quick reminder]] by [[https://emacs.stackexchange.com/users/780/glucas][Greg Lucas]] on how to enter date and their definition:

- *PLAIN timestamp* (=C-c .=) :: This is used for things like appointments where
  the entry occurs at a specific date/time. Such an entry will show up in
  the agenda on the specified day, and will not show up after that day has
  passed. Note that an appointment in the past won't keep showing up on
  your agenda regardless of whether you mark it DONE: if you didn't go to
  your doctor's appointment yesterday, that doesn't mean you still have one
  today!

- *SCHEDULED timestamp* (=C-c C-s=) :: This is used to indicate when you intend to
  do the task. It will show up on the agenda on the scheduled day. If you
  don't complete the task at that time, it will continue to show up on the
  agenda on the following days to show you that you have not completed
  something that you planned to do.

- *DEADLINE timestamp* (=C-c C-d=) :: This is used to indicate when something must
  be completed. Typically you want to see deadlines ahead of time, so that
  you can do whatever it is that must be done to meet them. Like a
  scheduled entry, if you miss a deadline it will continue to appear on the
  agenda as past due.

- *INACTIVE timestamp* (=C-c !=) :: This is when you want to attach a date to an
  entry but do not want it to show up in the agenda at all. Inactive
  timestamps have no special behavior.

