GTD.html

<div id="outline-container-org766e892" class="outline-3">
<h3 id="org766e892">Recurrent events</h3>
<div class="outline-text-3" id="text-org766e892">
<p>
Beside notes taking, I send or received a number of appointments (generally
through mail) and I need to save them. I prefer not to file them in my
inbox since generally I know both the topic and when they will occur such
that I can directly store them in a dedicated <code>agenda.org</code> file that will be
used to store all my scheduled events and meetings. Let's first add this
new file to the list of org files:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq org-agenda-files (list <span class="org-string">"inbox.org"</span> <span class="org-string">"agenda.org"</span>))
</pre>
</div>

<p>
The initial file has a basic startup header configuration and I also
defined a set of default <a href="https://orgmode.org/manual/Tags.html">tags</a> using the <code>#+TAGS</code> syntax. This will ease the
assignment of tags when adding a new entry or modifying an entry (we'll
that later):
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+STARTUP: hideall showstars indent</span>
<span class="org-org-meta-line">#+TAGS:    event(e) meeting(m) deadline(d)</span>
<span class="org-org-meta-line">#+TAGS:    @outside(o) @imn(i) @inria(r) @online(l) @canceled(c)</span>
</pre>
</div>

<p>
The structure of my agenda is split into birthdays and recurrent / past /
future events. This quite arbitrary and you can use any a different
structure. 
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Birthdays</span></span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Recurrent</span></span>
  * <span class="org-bold">Scheduled</span>
  * <span class="org-bold">People</span>
  * <span class="org-bold">Team</span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Past</span></span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Future</span></span>
</pre>
</div>

<p>
Let's first start filling the birthdays part. For any yearly event such as
birthdays, we can add special entries using the <a href="https://www.gnu.org/software/emacs/manual/html_node/org/Weekly_002fdaily-agenda.html">org-anniversary</a> syntax
(from the <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Diary.html">diary</a>).
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Birthdays</span></span>
  %%(org-anniversary 1976 6  1) Emacs is %d years old
  %%(org-anniversary 1953 3 16) Richard Stallman is %d years old
</pre>
</div>

<p>
Each time month/day is displayed in the agenda, the corresponding text will
be displayed as well.
</p>

<p>
For the recurrent events, I make a separation between scheduled, people and
team. In my case, scheduled events are mostly daily events and I use the
agenda as a reminder. I could have used the <a href="https://orgmode.org/manual/Repeated-tasks.html">repeating tasks</a> feature (using
syntax such as <i><span class="timestamp-wrapper"><span class="timestamp">[2020-09-12 Sat 09:00 +1d]</span></span></i>, but the problem is that I wanted
to have some daily repeating task only for workdays and the previous syntax
does not offer such choice. Instead, I've used the <a href="https://stackoverflow.com/questions/28369833">following code</a>:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Recurrent</span></span>
  * <span class="org-bold">Scheduled</span>
    * <span class="org-bold">GTD Review</span> 18:00-18:20                                          <span class="org-italic">:review:@home:</span>
      <span class="org-org-special-keyword"><span class="org-italic">SCHEDULED:</span></span><span class="org-italic"> </span><span class="org-org-sexp-date"><span class="org-italic">&lt;%%(memq (calendar-day-of-week date) '(1 2 3 4 5))&gt;</span></span>
    * <span class="org-bold">Notes cleaning</span> 18:20-18:30                                      <span class="org-italic">:review:@home:</span>
      <span class="org-org-special-keyword"><span class="org-italic">SCHEDULED:</span></span><span class="org-italic"> </span><span class="org-org-sexp-date"><span class="org-italic">&lt;%%(memq (calendar-day-of-week date) '(1 2 3 4 5))&gt;</span></span>
    * <span class="org-bold">Agenda cleaning</span>                                                 <span class="org-italic">:review:@home:</span>
      <span class="org-org-special-keyword"><span class="org-italic">SCHEDULED:</span></span><span class="org-italic"> </span><span class="org-org-date"><span class="org-italic">&lt;2020-09-01 Tue +1m&gt;</span></span>
</pre>
</div>

<p>
For recurrent events with people, I do not use the repeating task feature
because I want to be able to cancel a specific meeting if it did not happen
and also to use the entry for taking notes (we will see that below).
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Recurrent</span></span>
  * <span class="org-bold">People</span>
    * <span class="org-bold">Student A (weekly meeting)</span>                                           <span class="org-italic">:meeting:</span>
      * <span class="org-bold">Student A</span>                                                        <span class="org-italic">:@canceled:</span>
        <span class="org-org-date"><span class="org-italic">&lt;2020-09-14 Mon 10:00-11:00&gt;</span></span>
      * <span class="org-bold">Student A</span>                                                          <span class="org-italic">:@online:</span>
        <span class="org-org-date"><span class="org-italic">&lt;2020-09-07 Mon 10:00-11:00&gt;</span></span>
      * <span class="org-bold">Student A</span>                                                             <span class="org-italic">:@imn:</span>
        <span class="org-org-date"><span class="org-italic">&lt;2020-09-14 Mon 10:00-11:00&gt;</span></span>
</pre>
</div>

<p>
For these recurrent events, I write them directly into the agenda file at
the end of a meeting where we generally agree on next meeting. Here is
<a href="https://emacs.stackexchange.com/questions/10504">quick reminder</a> by <a href="https://emacs.stackexchange.com/users/780/glucas">Greg Lucas</a> on how to enter date and their definition:
</p>

<dl class="org-dl">
<dt><b>PLAIN timestamp</b> (<code>C-c .</code>)</dt><dd>This is used for things like appointments where
the entry occurs at a specific date/time. Such an entry will show up in
the agenda on the specified day, and will not show up after that day has
passed. Note that an appointment in the past won't keep showing up on
your agenda regardless of whether you mark it DONE: if you didn't go to
your doctor's appointment yesterday, that doesn't mean you still have one
today!</dd>

<dt><b>SCHEDULED timestamp</b> (<code>C-c C-s</code>)</dt><dd>This is used to indicate when you intend to
do the task. It will show up on the agenda on the scheduled day. If you
don't complete the task at that time, it will continue to show up on the
agenda on the following days to show you that you have not completed
something that you planned to do.</dd>

<dt><b>DEADLINE timestamp</b> (<code>C-c C-d</code>)</dt><dd>This is used to indicate when something must
be completed. Typically you want to see deadlines ahead of time, so that
you can do whatever it is that must be done to meet them. Like a
scheduled entry, if you miss a deadline it will continue to appear on the
agenda as past due.</dd>

<dt><b>INACTIVE timestamp</b> (<code>C-c !</code>)</dt><dd>This is when you want to attach a date to an
entry but do not want it to show up in the agenda at all. Inactive
timestamps have no special behavior.</dd>
</dl>
</div>
</div>
