GTD.org
** Meetings & notes

Now it is time to define a new capture template for registering a meeting.

#+begin_src lisp
("m" "Meeting" entry  (file+headline "agenda.org" "Future")
 ,(concat "* %? :meeting:\n"
         "<%<%Y-%m-%d %a %H:00>>"))
#+end_src

It is not very complicated: any meeting will be filed in =agenda.org= under
the *Future* header (and will be refiled later, during agenda review). By
default, the timestamp is the current day with a rounded clock since my
meetings generally starts at plain hours. When invoked, this template looks
like:

#+begin_src org
*Capture buffer. Finish 'C-c C-c', refile 'C-c C-w', abort 'C-c C-k'.*
,* +_+                                                                        /:meeting:/
  /<2020-09-11 Fri 11:00>/
#+end_src

When I enter a meeting, I generally use the name of people that will be
present at the meeting (if there are not too many people) or the topic of
the meeting. The goal is to have short but useful information when the
meeting shows up in my agenda.

The next step is to define a "Note" template that will be used to take
notes during a meeting:

#+begin_src lisp
("n" "Note" entry  (file "notes.org")
 ,(concat "* Note (%a)\n"
         "/Entered on/ %U\n" "\n" "%?"))
#+end_src

We will (temporarily) store these notes in a =notes.org= dedicated file.
Maybe you've noticed the "=%a=", in the template. This is a [[https://orgmode.org/manual/Template-expansion.html#Template-expansion][template
extension]] that will be resolved to the content created with the
*org-store-link* command. However, if you capture a note while your cursor is
on the same line of an agenda entry, the content will be filled with this
entry. This is super convenient to link your note with the agenda entry.

My initial =notes.org= is as follows:

#+begin_src org
#+STARTUP: content showstars indent
#+FILETAGS: notes
#+end_src

Nothing fancy here since it is actually a temporary storage, notes will be
later moved to the relevant project they belong to.

** Summary 

Here is our updated configuration:

#+HTML: <details><summary><b>GTD.el</b> (version 2)</summary>
#+begin_src lisp
(require 'org)

(setq org-directory "~/Documents/org")
(setq org-agenda-files (list "inbox.org" "agenda.org" "notes.org"))

(setq org-capture-templates
      `(("i" "Inbox" entry  (file "inbox.org")
        ,(concat "* TODO %?\n"
                 "/Entered on/ %U"))
        ("m" "Meeting" entry  (file+headline "agenda.org" "Future")
        ,(concat "* %? :meeting:\n"
                 "<%<%Y-%m-%d %a %H:00>>"))
        ("n" "Note" entry  (file "notes.org")
        ,(concat "* Note (%a)\n"
                 "/Entered on/ %U\n" "\n" "%?"))
        ("@" "Inbox [mu4e]" entry (file "inbox.org")
        ,(concat "* TODO Reply to \"%a\" %?\n"
                 "/Entered on/ %U"))))

(defun org-capture-inbox ()
     (interactive)
     (call-interactively 'org-store-link)
     (org-capture nil "i"))

(defun org-capture-mail ()
  (interactive)
  (call-interactively 'org-store-link)
  (org-capture nil "@"))

;; Use full window for org-capture
(add-hook 'org-capture-mode-hook 'delete-other-windows)

(define-key global-map            (kbd "C-c a") 'org-agenda)
(define-key global-map            (kbd "C-c c") 'org-capture)
(define-key global-map            (kbd "C-c i") 'org-capture-inbox)

;; Only if you use mu4e
;; (require 'mu4e)
;; (define-key mu4e-headers-mode-map (kbd "C-c i") 'org-capture-mail)
;; (define-key mu4e-view-mode-map    (kbd "C-c i") 'org-capture-mail)
#+end_src
#+HTML: </details>

The set of available commands is now:

| Command                          | Bindings         | Mode + where           |
|----------------------------------+------------------|------------------------|
| Agenda                           | *C-c a*            | any                    |
| Agenda for today                 | *C-c a a*          | any                    |
|                                  |                  |                        |
| Capture menu                     | *C-c c*            | any                    |
| Capture meeting (agenda.org)     | *C-c c m*          | any                    |
| Capture meeting note (notes.org) | *C-c c n*          | any                    |
| Capture generic TODO (inbox.org) | *C-c i* or *C-c c i* | any                    |
| Capture mail TODO (inbox.org)    | *C-c i* or *C-c c @* | mu4e view/headers mode |
|                                  |                  |                        |
| Add/Remove tag                   | *C-c C-c*          | org-mode on headline   |
|                                  |                  |                        |
| Plain timestamp                  | *C-c .*            | org-mode               |
| Scheduled timestamp              | *C-c C-s*          | org-mode               |
| Deadline timestamp               | *C-c C-d*          | org-mode               |
| Inactive timestamp               | *C-c !*            | org-mode               |

* Review
#+HTML: <div class="back"><a href="#table-of-contents">⌘ Back to top</a></div>

The actual review process is probably the less documented aspect of GTD
from all the resources I've read so far. When it is mentioned, some people
explain they have a weekly review while some others uses a daily review. To
get things further complicated, it is not clear if this process is a matter
of a few minutes or a matter of hours. My personal point of view so far
(and this may change in the future) is that a daily process is probably the
way to go in my case since I'm adding from 5 to 10 entries to my inbox
each day (mail included). For me, the end of the work day seems to be the
best time to do the review since my memory is still fresh with things I've
done during the day, and what may come next for each project.

