GTD.html

<div id="outline-container-org8696764" class="outline-3">
<h3 id="org8696764">Meetings &amp; notes</h3>
<div class="outline-text-3" id="text-org8696764">
<p>
Now it is time to define a new capture template for registering a meeting.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-string">"m"</span> <span class="org-string">"Meeting"</span> entry  (file+headline <span class="org-string">"agenda.org"</span> <span class="org-string">"Future"</span>)
 ,(concat <span class="org-string">"* %? :meeting:\n"</span>
         <span class="org-string">"&lt;%&lt;%Y-%m-%d %a %H:00&gt;&gt;"</span>))
</pre>
</div>

<p>
It is not very complicated: any meeting will be filed in <code>agenda.org</code> under
the <b>Future</b> header (and will be refiled later, during agenda review). By
default, the timestamp is the current day with a rounded clock since my
meetings generally starts at plain hours. When invoked, this template looks
like:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-bold">Capture buffer. Finish 'C-c C-c', refile 'C-c C-w', abort 'C-c C-k'.</span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="custom">_</span></span><span class="org-org-level-1">                                                                        </span><span class="org-org-level-1"><span class="org-italic">:meeting:</span></span>
  <span class="org-org-date"><span class="org-italic">&lt;2020-09-11 Fri 11:00&gt;</span></span>
</pre>
</div>

<p>
When I enter a meeting, I generally use the name of people that will be
present at the meeting (if there are not too many people) or the topic of
the meeting. The goal is to have short but useful information when the
meeting shows up in my agenda.
</p>

<p>
The next step is to define a "Note" template that will be used to take
notes during a meeting:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-string">"n"</span> <span class="org-string">"Note"</span> entry  (file <span class="org-string">"notes.org"</span>)
 ,(concat <span class="org-string">"* Note (%a)\n"</span>
         <span class="org-string">"/Entered on/ %U\n"</span> <span class="org-string">"\n"</span> <span class="org-string">"%?"</span>))
</pre>
</div>

<p>
We will (temporarily) store these notes in a <code>notes.org</code> dedicated file.
Maybe you've noticed the "<code>%a</code>", in the template. This is a <a href="https://orgmode.org/manual/Template-expansion.html#Template-expansion">template
extension</a> that will be resolved to the content created with the
<b>org-store-link</b> command. However, if you capture a note while your cursor is
on the same line of an agenda entry, the content will be filled with this
entry. This is super convenient to link your note with the agenda entry.
</p>

<p>
My initial <code>notes.org</code> is as follows:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+STARTUP: content showstars indent</span>
<span class="org-org-meta-line">#+FILETAGS: notes</span>
</pre>
</div>

<p>
Nothing fancy here since it is actually a temporary storage, notes will be
later moved to the relevant project they belong to.
</p>
</div>
</div>

<div id="outline-container-org6db3673" class="outline-3">
<h3 id="org6db3673">Summary</h3>
<div class="outline-text-3" id="text-org6db3673">
<p>
Here is our updated configuration:
</p>

<details><summary><b>GTD.el</b> (version 2)</summary>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">org</span>)

(setq org-directory <span class="org-string">"~/Documents/org"</span>)
(setq org-agenda-files (list <span class="org-string">"inbox.org"</span> <span class="org-string">"agenda.org"</span> <span class="org-string">"notes.org"</span>))

(setq org-capture-templates
      `((<span class="org-string">"i"</span> <span class="org-string">"Inbox"</span> entry  (file <span class="org-string">"inbox.org"</span>)
        ,(concat <span class="org-string">"* TODO %?\n"</span>
                 <span class="org-string">"/Entered on/ %U"</span>))
        (<span class="org-string">"m"</span> <span class="org-string">"Meeting"</span> entry  (file+headline <span class="org-string">"agenda.org"</span> <span class="org-string">"Future"</span>)
        ,(concat <span class="org-string">"* %? :meeting:\n"</span>
                 <span class="org-string">"&lt;%&lt;%Y-%m-%d %a %H:00&gt;&gt;"</span>))
        (<span class="org-string">"n"</span> <span class="org-string">"Note"</span> entry  (file <span class="org-string">"notes.org"</span>)
        ,(concat <span class="org-string">"* Note (%a)\n"</span>
                 <span class="org-string">"/Entered on/ %U\n"</span> <span class="org-string">"\n"</span> <span class="org-string">"%?"</span>))
        (<span class="org-string">"@"</span> <span class="org-string">"Inbox [mu4e]"</span> entry (file <span class="org-string">"inbox.org"</span>)
        ,(concat <span class="org-string">"* TODO Reply to \"%a\" %?\n"</span>
                 <span class="org-string">"/Entered on/ %U"</span>))))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-capture-inbox</span> ()
     (interactive)
     (call-interactively 'org-store-link)
     (org-capture nil <span class="org-string">"i"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-capture-mail</span> ()
  (interactive)
  (call-interactively 'org-store-link)
  (org-capture nil <span class="org-string">"@"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Use full window for org-capture</span>
(add-hook 'org-capture-mode-hook 'delete-other-windows)

(define-key global-map            (kbd <span class="org-string">"C-c a"</span>) 'org-agenda)
(define-key global-map            (kbd <span class="org-string">"C-c c"</span>) 'org-capture)
(define-key global-map            (kbd <span class="org-string">"C-c i"</span>) 'org-capture-inbox)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Only if you use mu4e</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(require 'mu4e)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(define-key mu4e-headers-mode-map (kbd "C-c i") 'org-capture-mail)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(define-key mu4e-view-mode-map    (kbd "C-c i") 'org-capture-mail)</span>
</pre>
</div>
</details>

<p>
The set of available commands is now:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Bindings</th>
<th scope="col" class="org-left">Mode + where</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Agenda</td>
<td class="org-left"><b>C-c a</b></td>
<td class="org-left">any</td>
</tr>

<tr>
<td class="org-left">Agenda for today</td>
<td class="org-left"><b>C-c a a</b></td>
<td class="org-left">any</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Capture menu</td>
<td class="org-left"><b>C-c c</b></td>
<td class="org-left">any</td>
</tr>

<tr>
<td class="org-left">Capture meeting (agenda.org)</td>
<td class="org-left"><b>C-c c m</b></td>
<td class="org-left">any</td>
</tr>

<tr>
<td class="org-left">Capture meeting note (notes.org)</td>
<td class="org-left"><b>C-c c n</b></td>
<td class="org-left">any</td>
</tr>

<tr>
<td class="org-left">Capture generic TODO (inbox.org)</td>
<td class="org-left"><b>C-c i</b> or <b>C-c c i</b></td>
<td class="org-left">any</td>
</tr>

<tr>
<td class="org-left">Capture mail TODO (inbox.org)</td>
<td class="org-left"><b>C-c i</b> or <b>C-c c @</b></td>
<td class="org-left">mu4e view/headers mode</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Add/Remove tag</td>
<td class="org-left"><b>C-c C-c</b></td>
<td class="org-left">org-mode on headline</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Plain timestamp</td>
<td class="org-left"><b>C-c .</b></td>
<td class="org-left">org-mode</td>
</tr>

<tr>
<td class="org-left">Scheduled timestamp</td>
<td class="org-left"><b>C-c C-s</b></td>
<td class="org-left">org-mode</td>
</tr>

<tr>
<td class="org-left">Deadline timestamp</td>
<td class="org-left"><b>C-c C-d</b></td>
<td class="org-left">org-mode</td>
</tr>

<tr>
<td class="org-left">Inactive timestamp</td>
<td class="org-left"><b>C-c !</b></td>
<td class="org-left">org-mode</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgf831e2f" class="outline-2">
<h2 id="orgf831e2f">Review</h2>
<div class="outline-text-2" id="text-orgf831e2f">
<div class="back"><a href="#table-of-contents">⌘ Back to top</a></div>

<p>
The actual review process is probably the less documented aspect of GTD
from all the resources I've read so far. When it is mentioned, some people
explain they have a weekly review while some others uses a daily review. To
get things further complicated, it is not clear if this process is a matter
of a few minutes or a matter of hours. My personal point of view so far
(and this may change in the future) is that a daily process is probably the
way to go in my case since I'm adding from 5 to 10 entries to my inbox
each day (mail included). For me, the end of the work day seems to be the
best time to do the review since my memory is still fresh with things I've
done during the day, and what may come next for each project.
</p>
</div>
