GTD.org
** Basic setup

My review process consists mostly in moving things out of the inbox in
order to file them in the corresponding project if it exists or to create
one if this is not the case. To do that, we need first to create a new
=projects.org= file that will hold all our projects. The structure of this
file is quite important because you'll interact with it a lot of times. I
chose to split first my projects into global categories:

#+begin_src org
,#+STARTUP: content showstars indent
,* *Students*                                                                /:students:/
,* *Team*                                                                        /:team:/
,* *Collaboratorive projects*                                   /:collaborative:project:/
,* *Events organization*                                                       /:events:/
,* *Academic papers*                                                          /:article:/
,* *Personal projects*                                               /:personal:project:/
,* *ReScience*                                                              /:rescience:/
,* *Home*                                                                        /:home:/
#+end_src

I then add projects under one of these categories using a specific
structure. Let me show you a typical student "project":

#+begin_src org
,* *Students*                                                                /:students:/
  ,* *J.Doe (PhD)* [/]                                                      /:phd:j.doe:/
    /:PROPERTIES:/
    /:CATEGORY: J.DOE/
    /:VISIBILITY: hide/
    /:COOKIE_DATA: recursive todo/
    /:END:/
    ,* *Information*                                                             /:info:/
      /:PROPERTIES:/
      /:VISIBILITY: hide/
      /:END:/
    ,* *Notes*                                                                  /:notes:/
      /:PROPERTIES:/
      /:VISIBILITY: hide/
      /:END:/
    ,* *Tasks*                                                                  /:tasks:/
      /:PROPERTIES:/
      /:VISIBILITY: content/
      /:END:/
#+end_src

The *information* section contains information related to the project and
you're free to organize the way you want. The *notes* section is where I move
meeting notes related to this project during my notes review. Finally, the
*tasks* is where I will move related inbox entries. I also set different
[[https://orgmode.org/manual/Initial-visibility.html][visibility]] properties for each section: information and notes are hidden
while tasks section is open. You might have also noticed the [[https://orgmode.org/manual/Breaking-Down-Tasks.html][COOKIE_DATA]]
property at the top and the =[/]= at the end of the project name. These two
components will help us to track the number of pending tasks vs the number
of completed tasks. Each time we'll move a task from the *TODO* state to the
*DONE* state, the header will be updated accordingly (you can also refresh it
with =C-c C-c= when the cursor is over it).

The overall number of projects is very dependent on you. In my case, I've
about 40 opened projects. Some will last a few months (e.g. academic
papers), some will last a few years (e.g. grants and phd students) and some
others do not have foreseeable end (house, garden, car).

