GTD.html

<div id="outline-container-orgd62eb19" class="outline-3">
<h3 id="orgd62eb19">Basic setup</h3>
<div class="outline-text-3" id="text-orgd62eb19">
<p>
My review process consists mostly in moving things out of the inbox in
order to file them in the corresponding project if it exists or to create
one if this is not the case. To do that, we need first to create a new
<code>projects.org</code> file that will hold all our projects. The structure of this
file is quite important because you'll interact with it a lot of times. I
chose to split first my projects into global categories:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+STARTUP: content showstars indent</span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Students</span></span><span class="org-org-level-1">                                                                </span><span class="org-org-level-1"><span class="org-italic">:students:</span></span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Team</span></span><span class="org-org-level-1">                                                                        </span><span class="org-org-level-1"><span class="org-italic">:team:</span></span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Collaboratorive projects</span></span><span class="org-org-level-1">                                   </span><span class="org-org-level-1"><span class="org-italic">:collaborative:project:</span></span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Events organization</span></span><span class="org-org-level-1">                                                       </span><span class="org-org-level-1"><span class="org-italic">:events:</span></span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Academic papers</span></span><span class="org-org-level-1">                                                          </span><span class="org-org-level-1"><span class="org-italic">:article:</span></span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Personal projects</span></span><span class="org-org-level-1">                                               </span><span class="org-org-level-1"><span class="org-italic">:personal:project:</span></span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">ReScience</span></span><span class="org-org-level-1">                                                              </span><span class="org-org-level-1"><span class="org-italic">:rescience:</span></span>
<span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Home</span></span><span class="org-org-level-1">                                                                        </span><span class="org-org-level-1"><span class="org-italic">:home:</span></span>
</pre>
</div>

<p>
I then add projects under one of these categories using a specific
structure. Let me show you a typical student "project":
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-bold">Students</span></span><span class="org-org-level-1">                                                                </span><span class="org-org-level-1"><span class="org-italic">:students:</span></span>
  * <span class="org-bold">J.Doe (PhD)</span> <span class="org-org-checkbox-statistics-todo">[/]</span>                                                      <span class="org-italic">:phd:j.doe:</span>
    <span class="org-italic">:PROPERTIES:</span>
    <span class="org-italic">:CATEGORY: J.DOE</span>
    <span class="org-italic">:VISIBILITY: hide</span>
    <span class="org-italic">:COOKIE_DATA: recursive todo</span>
    <span class="org-italic">:END:</span>
    * <span class="org-bold">Information</span>                                                             <span class="org-italic">:info:</span>
      <span class="org-italic">:PROPERTIES:</span>
      <span class="org-italic">:VISIBILITY: hide</span>
      <span class="org-italic">:END:</span>
    * <span class="org-bold">Notes</span>                                                                  <span class="org-italic">:notes:</span>
      <span class="org-italic">:PROPERTIES:</span>
      <span class="org-italic">:VISIBILITY: hide</span>
      <span class="org-italic">:END:</span>
    * <span class="org-bold">Tasks</span>                                                                  <span class="org-italic">:tasks:</span>
      <span class="org-italic">:PROPERTIES:</span>
      <span class="org-italic">:VISIBILITY: content</span>
      <span class="org-italic">:END:</span>
</pre>
</div>

<p>
The <b>information</b> section contains information related to the project and
you're free to organize the way you want. The <b>notes</b> section is where I move
meeting notes related to this project during my notes review. Finally, the
<b>tasks</b> is where I will move related inbox entries. I also set different
<a href="https://orgmode.org/manual/Initial-visibility.html">visibility</a> properties for each section: information and notes are hidden
while tasks section is open. You might have also noticed the <a href="https://orgmode.org/manual/Breaking-Down-Tasks.html">COOKIE_DATA</a>
property at the top and the <code>[/]</code> at the end of the project name. These two
components will help us to track the number of pending tasks vs the number
of completed tasks. Each time we'll move a task from the <b>TODO</b> state to the
<b>DONE</b> state, the header will be updated accordingly (you can also refresh it
with <code>C-c C-c</code> when the cursor is over it).
</p>

<p>
The overall number of projects is very dependent on you. In my case, I've
about 40 opened projects. Some will last a few months (e.g. academic
papers), some will last a few years (e.g. grants and phd students) and some
others do not have foreseeable end (house, garden, car).
</p>
</div>
</div>
