GTD.html

<div id="outline-container-org8c6ecc6" class="outline-3">
<h3 id="org8c6ecc6">Moving things</h3>
<div class="outline-text-3" id="text-org8c6ecc6">
<p>
Before refiling inbox entries into projects, I usually try to set an
estimated time (effort) needed to complete the tasks as well as some
contextual information (using tags). To ease the process, we'll first
modify the inbox header to add typical estimated efforts and some tags that
will speed the overall processing of each entry.
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+STARTUP: content showstars indent</span>
<span class="org-org-meta-line">#+TAGS: @home(h) @work(w) @mail(m) @comp(c) @web(b) </span>
<span class="org-org-meta-line">#+PROPERTY: Effort_ALL 0 0:05 0:10 0:15 0:30 0:45 1:00 2:00 4:00</span>
</pre>
</div>

<p>
Before refiling (i.e. moving) an entry, I will set some tags using the <code>C-c
C-c</code> keybinding and if the entry is an atomic task (i.e. that can be done
independently of any others tasks), I'll assign an <a href="https://orgmode.org/manual/Effort-Estimates.html">estimated effort</a> using
the existing <code>C-c C-x e</code> key binding. For example, let's consider the
following entry before review:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Write review section (GTD.org)</span>
  <span class="org-italic">Entered on </span><span class="org-org-date"><span class="org-italic">[2020-09-12 Sat 09:20]</span></span>
</pre>
</div>

<p>
After having set effort and tags, the entry reads:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Write review section (GTD.org)                                        </span><span class="org-org-level-1"><span class="org-org-tag">:@comp:</span></span>
  <span class="org-italic">:PROPERTIES:</span>
  <span class="org-italic">:Effort:   0:30</span>
  <span class="org-italic">:END:</span>
  <span class="org-italic">Entered on </span><span class="org-org-date"><span class="org-italic">[2020-09-12 Sat 09:20]</span></span>
</pre>
</div>

<p>
Tags are supposed to give some contextual information on where the task can
be completed. However, I did not really use them partly due to the 2020
sanitary crisis that tends to blur the line between work and home. Setting
the estimated is however quite important for me because when I'll activate
a task, the estimated effort will be displayed in the agenda and will help
me to decide if I can engage in task depending on the amount of free time I
have. This is especially useful for small tasks (5 minutes) that can be
completed any time.
</p>

<p>
Now it's time to move the entry.
</p>

<p>
I explained that inbox entries have to be moved into the relevant project
under the <b>Tasks</b> headline. To do that, we'll use the <a href="https://orgmode.org/manual/Refile-and-Copy.html#Refile-and-Copy">org-refile</a> function
(bound to <code>C-c C-w</code> when on a headline) and specify where the entry can be
refiled in the <code>projects.org</code>. If you remember, we also have notes that
needs to be refiled in projects such that targets in <code>projects.org</code> are
either <b>Notes</b> or <b>Tasks</b>. We thus need to define a refile target using
regexp. One easy way to do that is to use the <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Regexp-Functions.html">regexp-opt</a> function:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(regexp-opt '(<span class="org-string">"Tasks"</span> <span class="org-string">"Notes"</span>))
</pre>
</div>

<p>
You can evaluate the expression by placing the cursor at the end of the
line and type <code>C-u C-x C-e</code>. The optimized regex
(<code>"\\(?:\\(?:Note\\|Task\\)s\\)"</code>) should appear at the end of the line. We
can now use it so specifiy our targets:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq org-refile-targets
      '((<span class="org-string">"projects.org"</span> <span class="org-builtin">:regexp</span> . <span class="org-string">"\\(?:\\(?:Note\\|Task\\)s\\)"</span>)))
</pre>
</div>

<p>
Last step is to tell org-mode we want to specify a refile target using the
file path.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq org-refile-use-outline-path 'file)
(setq org-outline-path-complete-in-steps nil)
</pre>
</div>

<p>
To refile a J.Doe related inbox entry, you can then type:
</p>

<pre class="example" id="org802f922">
C-c C-w + "J.Doe" + tab + "T" + tab
</pre>

<p>
and this will be resolved to <code>"projects.org/Students/J.Doe/Tasks"</code>.
</p>
</div>
</div>

<div id="outline-container-org3fd9e80" class="outline-3">
<h3 id="org3fd9e80">Activating tasks</h3>
<div class="outline-text-3" id="text-org3fd9e80">
<p>
After having emptied the inbox, it's time to have a look at the different
projects to decide what are the next tasks to be activated. Before doing
that, we need to define what is an active task. Org-mode defines <a href="https://orgmode.org/manual/TODO-Basics.html">two
different states</a> for <b>TODO</b> items: <b>TODO</b> and <b>DONE</b>. We need to modify this in
order to introduce two new non-terminal state: <b>NEXT</b> to express this is the
next task to be completed and <b>HOLD</b> to express this task is on hold (for
whaterver reason):
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq org-todo-keywords
      '((sequence <span class="org-string">"TODO(t)"</span> <span class="org-string">"NEXT(n)"</span> <span class="org-string">"HOLD(h)"</span> <span class="org-string">"|"</span> <span class="org-string">"DONE(d)"</span>)))
</pre>
</div>

<p>
Thanks to <a href="https://emacs.stackexchange.com/questions/35751">Erik Anderson</a>, we can also add a hook that will log when we
activate a task by creating an "ACTIVATED" property the first time the task
enters the <b>NEXT</b> state:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">log-todo-next-creation-date</span> (<span class="org-type">&amp;rest</span> ignore)
  <span class="org-doc">"Log NEXT creation time in the property drawer under the key 'ACTIVATED'"</span>
  (<span class="org-keyword">when</span> (and (string= (org-get-todo-state) <span class="org-string">"NEXT"</span>)
             (not (org-entry-get nil <span class="org-string">"ACTIVATED"</span>)))
    (org-entry-put nil <span class="org-string">"ACTIVATED"</span> (format-time-string <span class="org-string">"[%Y-%m-%d]"</span>))))
(add-hook 'org-after-todo-state-change-hook #'log-todo-next-creation-date)
</pre>
</div>

<p>
We'll see in the next section how to exploit this property. Next step is to
<a href="https://orgmode.org/manual/Checkboxes.html">update the trailing</a> <code>[/]</code> behind each headline. To do that, you can type <code>C-u
C-c #</code>. For each projects, you now have something like <code>[x/y]</code> where x is the
number of closed tasks and y is the total number of tasks. Any project with
x &lt; y means that there are some tasks that can be activated. You can now
selectively open a project and decide if you want to activate one of the
non closed task. The most easy way to do that is to go over the TODO
keyword and use <code>S-right</code> to advance to the <b>NEXT</b> state.
</p>
</div>
</div>
