GTD.html

<div id="outline-container-org6bf79fc" class="outline-3">
<h3 id="org6bf79fc">Completing a task</h3>
<div class="outline-text-3" id="text-org6bf79fc">
<p>
Once you've chosen a task to do, and before starting the task, you can
choose to log the time it will actually take to complete the task such that
you can later refine your estimation. Just type <b>C-c C-x C-i</b> (clock in) to
start the clock and <b>C-c C-x C-o</b> (clock out) to stop the clock and to add the
duration in the logbook. Once a task is completed, you can change its state
from <b>NEXT</b> to <b>DONE</b> (using <b>S-right</b> while the cursor is over the <b>NEXT</b>
word). In order to keep track of when the task was completed, we can ask
org-mode to log that:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq org-log-done 'time)
</pre>
</div>

<p>
This will add a CLOSED: <span class="timestamp-wrapper"><span class="timestamp">[2020-09-13 Sun 19:24] </span></span> line under the corresponding
entry. Using this time, we can thus display the tasks that have been
completed during the day (see the last line of our agenda custom commands).
</p>

<p>
To summarize, for a given task:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Some task</span>
  <span class="org-italic">Entered on </span><span class="org-org-date"><span class="org-italic">[2020-09-13 Sun 19:23]</span></span>
</pre>
</div>

<p>
It will be first modified be when the estimated effort is set:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-todo">TODO</span></span><span class="org-org-level-1"> Some task</span>
  <span class="org-italic">:PROPERTIES:</span>
  <span class="org-italic">:EFFORT: 0:30</span>
  <span class="org-italic">:END:</span>
  <span class="org-italic">Entered on </span><span class="org-org-date"><span class="org-italic">[2020-09-13 Sun 19:23]</span></span>
</pre>
</div>

<p>
and further modified when activated:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* NEXT Some task</span>
  <span class="org-italic">:PROPERTIES:</span>
  <span class="org-italic">:EFFORT: 0:30</span>
  <span class="org-italic">:ACTIVATED: </span><span class="org-org-date"><span class="org-italic">[2020-09-13 Sun]</span></span>
  <span class="org-italic">:END:</span>
  <span class="org-italic">Entered on </span><span class="org-org-date"><span class="org-italic">[2020-09-13 Sun 19:23]</span></span>
</pre>
</div>

<p>
Finally, once completed, we have:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-level-1">* </span><span class="org-org-level-1"><span class="org-org-done">DONE</span></span><span class="org-org-level-1"> </span><span class="org-org-level-1"><span class="org-org-headline-done">Some task</span></span>
  <span class="org-org-special-keyword"><span class="org-italic">CLOSED:</span></span><span class="org-italic"> </span><span class="org-org-date"><span class="org-italic">[2020-09-13 Sun 20:14]</span></span>
  <span class="org-italic">:PROPERTIES:</span>
  <span class="org-italic">:EFFORT: 0:30</span>
  <span class="org-italic">:ACTIVATED: </span><span class="org-org-date"><span class="org-italic">[2020-08-30]</span></span>
  <span class="org-italic">:END:</span>
  <span class="org-italic">:LOGBOOK:</span>
  <span class="org-org-special-keyword"><span class="org-italic">CLOCK:</span></span><span class="org-italic"> </span><span class="org-org-date"><span class="org-italic">[2020-09-13 Sun 19:55]--[2020-09-13 Sun 20:14]</span></span><span class="org-italic"> =&gt; 0:19</span>
  <span class="org-italic">:END:</span>
  <span class="org-italic">Entered on </span><span class="org-org-date"><span class="org-italic">[2020-09-13 Sun 19:23]</span></span>
</pre>
</div>

<p>
Next time we have to estimate the effort for this specific task, and based
on the above log, we'll probably set it to 20 minutes instead of 30.
</p>
</div>
</div>
