GTD.html

<div id="outline-container-org0993877" class="outline-3">
<h3 id="org0993877">Summary</h3>
<div class="outline-text-3" id="text-org0993877">
<p>
Our final configuration is thus
</p>

<details><summary><b>GTD.el</b> (version 4)</summary>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">org</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Files</span>
(setq org-directory <span class="org-string">"~/Documents/org"</span>)
(setq org-agenda-files (list <span class="org-string">"inbox.org"</span> <span class="org-string">"agenda.org"</span>
                             <span class="org-string">"notes.org"</span> <span class="org-string">"projects.org"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Capture</span>
(setq org-capture-templates
      `((<span class="org-string">"i"</span> <span class="org-string">"Inbox"</span> entry  (file <span class="org-string">"inbox.org"</span>)
        ,(concat <span class="org-string">"* TODO %?\n"</span>
                 <span class="org-string">"/Entered on/ %U"</span>))
        (<span class="org-string">"m"</span> <span class="org-string">"Meeting"</span> entry  (file+headline <span class="org-string">"agenda.org"</span> <span class="org-string">"Future"</span>)
        ,(concat <span class="org-string">"* %? :meeting:\n"</span>
                 <span class="org-string">"&lt;%&lt;%Y-%m-%d %a %H:00&gt;&gt;"</span>))
        (<span class="org-string">"n"</span> <span class="org-string">"Note"</span> entry  (file <span class="org-string">"notes.org"</span>)
        ,(concat <span class="org-string">"* Note (%a)\n"</span>
                 <span class="org-string">"/Entered on/ %U\n"</span> <span class="org-string">"\n"</span> <span class="org-string">"%?"</span>))
        (<span class="org-string">"@"</span> <span class="org-string">"Inbox [mu4e]"</span> entry (file <span class="org-string">"inbox.org"</span>)
        ,(concat <span class="org-string">"* TODO Reply to \"%a\" %?\n"</span>
                 <span class="org-string">"/Entered on/ %U"</span>))))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-capture-inbox</span> ()
     (interactive)
     (call-interactively 'org-store-link)
     (org-capture nil <span class="org-string">"i"</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">org-capture-mail</span> ()
  (interactive)
  (call-interactively 'org-store-link)
  (org-capture nil <span class="org-string">"@"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Use full window for org-capture</span>
(add-hook 'org-capture-mode-hook 'delete-other-windows)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Key bindings</span>
(define-key global-map            (kbd <span class="org-string">"C-c a"</span>) 'org-agenda)
(define-key global-map            (kbd <span class="org-string">"C-c c"</span>) 'org-capture)
(define-key global-map            (kbd <span class="org-string">"C-c i"</span>) 'org-capture-inbox)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Only if you use mu4e</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(require 'mu4e)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(define-key mu4e-headers-mode-map (kbd "C-c i") 'org-capture-mail)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(define-key mu4e-view-mode-map    (kbd "C-c i") 'org-capture-mail)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Refile</span>
(setq org-refile-use-outline-path 'file)
(setq org-outline-path-complete-in-steps nil)
(setq org-refile-targets
      '((<span class="org-string">"projects.org"</span> <span class="org-builtin">:regexp</span> . <span class="org-string">"\\(?:\\(?:Note\\|Task\\)s\\)"</span>)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">TODO</span>
(setq org-todo-keywords
      '((sequence <span class="org-string">"TODO(t)"</span> <span class="org-string">"NEXT(n)"</span> <span class="org-string">"HOLD(h)"</span> <span class="org-string">"|"</span> <span class="org-string">"DONE(d)"</span>)))
(<span class="org-keyword">defun</span> <span class="org-function-name">log-todo-next-creation-date</span> (<span class="org-type">&amp;rest</span> ignore)
  <span class="org-doc">"Log NEXT creation time in the property drawer under the key 'ACTIVATED'"</span>
  (<span class="org-keyword">when</span> (and (string= (org-get-todo-state) <span class="org-string">"NEXT"</span>)
             (not (org-entry-get nil <span class="org-string">"ACTIVATED"</span>)))
    (org-entry-put nil <span class="org-string">"ACTIVATED"</span> (format-time-string <span class="org-string">"[%Y-%m-%d]"</span>))))
(add-hook 'org-after-todo-state-change-hook #'log-todo-next-creation-date)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Agenda</span>
(setq org-agenda-custom-commands
      '((<span class="org-string">"g"</span> <span class="org-string">"Get Things Done (GTD)"</span>
         ((agenda <span class="org-string">""</span>
                  ((org-agenda-skip-function
                    '(org-agenda-skip-entry-if 'deadline))
                   (org-deadline-warning-days 0)))
          (todo <span class="org-string">"NEXT"</span>
                ((org-agenda-skip-function
                  '(org-agenda-skip-entry-if 'deadline))
                 (org-agenda-prefix-format <span class="org-string">"  %i %-12:c [%e] "</span>)
                 (org-agenda-overriding-header <span class="org-string">"\nTasks\n"</span>)))
          (agenda nil
                  ((org-agenda-entry-types '(<span class="org-builtin">:deadline</span>))
                   (org-agenda-format-date <span class="org-string">""</span>)
                   (org-deadline-warning-days 7)
                   (org-agenda-skip-function
                    '(org-agenda-skip-entry-if 'notregexp <span class="org-string">"\\* NEXT"</span>))
                   (org-agenda-overriding-header <span class="org-string">"\nDeadlines"</span>)))
          (tags-todo <span class="org-string">"inbox"</span>
                     ((org-agenda-prefix-format <span class="org-string">"  %?-12t% s"</span>)
                      (org-agenda-overriding-header <span class="org-string">"\nInbox\n"</span>)))
          (tags <span class="org-string">"CLOSED&gt;=\"&lt;today&gt;\""</span>
                ((org-agenda-overriding-header <span class="org-string">"\nCompleted today\n"</span>)))))))
</pre>
</div>
</details>


<p>
The set of available commands is now:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Bindings</th>
<th scope="col" class="org-left">Mode + where</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Agenda</td>
<td class="org-left"><b>C-c a</b></td>
<td class="org-left">any</td>
</tr>

<tr>
<td class="org-left">Agenda for today</td>
<td class="org-left"><b>C-c a a</b></td>
<td class="org-left">any</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Capture menu</td>
<td class="org-left"><b>C-c c</b></td>
<td class="org-left">any</td>
</tr>

<tr>
<td class="org-left">Capture meeting (agenda.org)</td>
<td class="org-left"><b>C-c c m</b></td>
<td class="org-left">any</td>
</tr>

<tr>
<td class="org-left">Capture meeting note (notes.org)</td>
<td class="org-left"><b>C-c c n</b></td>
<td class="org-left">any</td>
</tr>

<tr>
<td class="org-left">Capture generic TODO (inbox.org)</td>
<td class="org-left"><b>C-c i</b> or <b>C-c c i</b></td>
<td class="org-left">any</td>
</tr>

<tr>
<td class="org-left">Capture mail TODO (inbox.org)</td>
<td class="org-left"><b>C-c i</b> or <b>C-c c @</b></td>
<td class="org-left">mu4e view/headers mode</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Add/Remove tag</td>
<td class="org-left"><b>C-c C-c</b></td>
<td class="org-left">org-mode on headline</td>
</tr>

<tr>
<td class="org-left">Update progress indicator</td>
<td class="org-left"><b>C-c C-c</b></td>
<td class="org-left">org-mode on [/]</td>
</tr>

<tr>
<td class="org-left">Update all progress indicators</td>
<td class="org-left"><b>C-u C-c #</b></td>
<td class="org-left">org-mode</td>
</tr>

<tr>
<td class="org-left">Enter estimated effort</td>
<td class="org-left"><b>C-c C-x e</b></td>
<td class="org-left">org-mode on headline</td>
</tr>

<tr>
<td class="org-left">Refile section</td>
<td class="org-left"><b>C-c C-w</b></td>
<td class="org-left">org-mode on headline</td>
</tr>

<tr>
<td class="org-left">Move to next TODO state</td>
<td class="org-left"><b>S-right</b></td>
<td class="org-left">org-mode on TODO</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Clock in</td>
<td class="org-left"><b>C-c C-x C-i</b></td>
<td class="org-left">org-mode on headline</td>
</tr>

<tr>
<td class="org-left">Clock out</td>
<td class="org-left"><b>C-c C-x C-o</b></td>
<td class="org-left">org-mode on headline</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Plain timestamp</td>
<td class="org-left"><b>C-c .</b></td>
<td class="org-left">org-mode</td>
</tr>

<tr>
<td class="org-left">Scheduled timestamp</td>
<td class="org-left"><b>C-c s</b></td>
<td class="org-left">org-mode</td>
</tr>

<tr>
<td class="org-left">Deadline timestamp</td>
<td class="org-left"><b>C-c d</b></td>
<td class="org-left">org-mode</td>
</tr>

<tr>
<td class="org-left">Inactive timestamp</td>
<td class="org-left"><b>C-c !</b></td>
<td class="org-left">org-mode</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgad6a3d9" class="outline-2">
<h2 id="orgad6a3d9">Additional changes</h2>
<div class="outline-text-2" id="text-orgad6a3d9">
</div>
