GTD.org
** Automatic saving after refilling

After refilling, you will have to save manually your opened org files, which is not really convenient.
Fortunately, a small change in the code will save the files automatically.

First, you need to get the files you want to save with their fullpath.
Replace the previous definition of =org-agenda-files= with the following:

#+begin_src lisp
(setq org-agenda-files 
      (mapcar 'file-truename 
	      (file-expand-wildcards "~/Documents/org/*.org")))
#+end_src

Now, we create a new function to save those files, using the model of the =org-save-all-org-buffers= function and finally we add it after the =org-refile= action:
#+begin_src lisp
;; Save the corresponding buffers
(defun gtd-save-org-buffers ()
  "Save `org-agenda-files' buffers without user confirmation.
See also `org-save-all-org-buffers'"
  (interactive)
  (message "Saving org-agenda-files buffers...")
  (save-some-buffers t (lambda () 
			 (when (member (buffer-file-name) org-agenda-files) 
			   t)))
  (message "Saving org-agenda-files buffers... done"))

;; Add it after refile
(advice-add 'org-refile :after
	    (lambda (&rest _)
	      (gtd-save-org-buffers)))
#+end_src
* Conclusion
#+HTML: <div class="back"><a href="#table-of-contents">⌘ Back to top</a></div>

I'm now done describing my GTD setup and I hope it will be useful for some
readers. I'm rather new to GTD and there are certainly better ways to
implement GTD (see [[*Resources]]) and probably I'll modify some parts in the
future.

If you spot errors or typos, feel free to open an issue at
https://github.com/rougier/emacs-GTD. 

** Going further

As explained in the introduction, there are plenty of resources online
regarding org-mode in general and GTD with org-mode in particular. There
are also plenty of interactive places where you ask for help and find some
code:

- [[https://emacs.stackexchange.com/questions/tagged/org-mode][Emacs Stack Exchange]] 
- [[https://webchat.freenode.net/][IRC freenode]] (#org-mode) 
- [[https://www.reddit.com/r/orgmode/][Reddit]] (orgmode)
- [[https://lists.gnu.org/mailman/listinfo/emacs-orgmode][Mailing list]]

* Local Variables                                                    :noexport:
# Local Variables:
# fill-column: 75
# org-html-link-org-files-as-html: nil
# eval: (face-remap-add-relative 'org-level-2 '(face-strong face-salient))
# eval: (face-remap-add-relative 'org-level-3 '(face-salient default))
# eval: (face-remap-add-relative 'org-level-4 '(default))
# End:

