GTD.html
<div id="outline-container-orgd8a3d64" class="outline-3">
<h3 id="orgd8a3d64">Automatic saving after refilling</h3>
<div class="outline-text-3" id="text-orgd8a3d64">
<p>
After refilling, you will have to save manually your opened org files, which is not really convenient.
Fortunately, a small change in the code will save the files automatically.
</p>

<p>
First, you need to get the files you want to save with their fullpath.
Replace the previous definition of <code>org-agenda-files</code> with the following:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setq org-agenda-files 
      (mapcar 'file-truename 
          (file-expand-wildcards <span class="org-string">"~/Documents/org/*.org"</span>)))
</pre>
</div>

<p>
Now, we create a new function to save those files, using the model of the <code>org-save-all-org-buffers</code> function and finally we add it after the <code>org-refile</code> action:
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Save the corresponding buffers</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">gtd-save-org-buffers</span> ()
  <span class="org-doc">"Save `</span><span class="org-doc"><span class="org-constant">org-agenda-files</span></span><span class="org-doc">' buffers without user confirmation.</span>
<span class="org-doc">See also `</span><span class="org-doc"><span class="org-constant">org-save-all-org-buffers</span></span><span class="org-doc">'"</span>
  (interactive)
  (message <span class="org-string">"Saving org-agenda-files buffers..."</span>)
  (save-some-buffers t (<span class="org-keyword">lambda</span> () 
             (<span class="org-keyword">when</span> (member (buffer-file-name) org-agenda-files) 
               t)))
  (message <span class="org-string">"Saving org-agenda-files buffers... done"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Add it after refile</span>
(advice-add 'org-refile <span class="org-builtin">:after</span>
        (<span class="org-keyword">lambda</span> (<span class="org-type">&amp;rest</span> _)
          (gtd-save-org-buffers)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org326d709" class="outline-2">
<h2 id="org326d709">Conclusion</h2>
<div class="outline-text-2" id="text-org326d709">
<div class="back"><a href="#table-of-contents">⌘ Back to top</a></div>

<p>
I'm now done describing my GTD setup and I hope it will be useful for some
readers. I'm rather new to GTD and there are certainly better ways to
implement GTD (see <a href="#org5ed3798">Resources</a>) and probably I'll modify some parts in the
future.
</p>

<p>
If you spot errors or typos, feel free to open an issue at
<a href="https://github.com/rougier/emacs-GTD">https://github.com/rougier/emacs-GTD</a>. 
</p>
</div>

<div id="outline-container-orgbbabfb3" class="outline-3">
<h3 id="orgbbabfb3">Going further</h3>
<div class="outline-text-3" id="text-orgbbabfb3">
<p>
As explained in the introduction, there are plenty of resources online
regarding org-mode in general and GTD with org-mode in particular. There
are also plenty of interactive places where you ask for help and find some
code:
</p>

<ul class="org-ul">
<li><a href="https://emacs.stackexchange.com/questions/tagged/org-mode">Emacs Stack Exchange</a></li>
<li><a href="https://webchat.freenode.net/">IRC freenode</a> (#org-mode)</li>
<li><a href="https://www.reddit.com/r/orgmode/">Reddit</a> (orgmode)</li>
<li><a href="https://lists.gnu.org/mailman/listinfo/emacs-orgmode">Mailing list</a></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
